Revit 2024 API
BuiltInFailures.GeometryFailures.FailToConvertLine Property
 Unable to convert lines
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FailToConvertLine { get; }
Visual Basic
Public Shared ReadOnly Property FailToConvertLine As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FailToConvertLine {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace